# -*- coding: utf-8 -*-

# Представлен список чисел. Необходимо вывести элементы исходного списка, значения которых больше предыдущего элемента.
# Подсказка: элементы, удовлетворяющие условию, оформить в виде списка. Для формирования списка использовать генератор.
# Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
# Результат: [12, 44, 4, 10, 78, 123].

my_list = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]
my_new_list = [n for i, n in enumerate(my_list) if i != 0 if my_list[i] > my_list[i-1]]
print(f'Исходный список: {my_list}')
print(f'Список чисел значения которых больше предыдущего элемента: {my_new_list}')